"""
Задание №1
- Вспомните какие модули вы уже проходили на курсе.
- Создайте файл, в котором вы импортируете встроенные 
в модуль функции под псевдонимами. (3-7 строк импорта).
"""

from math import sqrt as sq 
from random import randint as ri
from re import sub as s # регулярные выражения

"""
- Вспомните какие модули вы уже проходили на курсе.
- Создайте файл, в котором вы импортируете встроенные в
модуль функции под псевдонимами. (3-7 строк импорта).
"""

from math import sqrt as sq
from random import uniform as uf
from re import sub as s # регулярные выражения